import {Card, Col, Container, Row} from "react-bootstrap";
import React from "react";

export function BioText(){
    return (
        <Container className="mt-5">
            <Row className="justify-content-center">
                <Col md={8}>
                    <Card className="shadow-lg p-4">
                        <Card.Body>
                            <Card.Title className="text-center mb-4">
                                <h2>Биография</h2>
                            </Card.Title>
                            <Card.Text style={{ fontSize: '18px', lineHeight: '1.6' }}>
                                Иван III родился 22 января 1440 года. Его отец Московский князь Василий II, мать Мария Ярославна, дедом которой был князь Владимир Храбрый. Иван был их первым ребенком, и когда ему едва исполнилось 5, отца пленили татары. Московское княжество тут же возглавил князь Дмитрий Шемяка, потомок древнего рода Ивана Калиты. Чтобы выбраться из плена, Василий II договорился с татарами о выкупе, и его отпустили восвояси. По прибытии в Москву он снова оказался на престоле, а Шемяку сослали в Углич.
                            </Card.Text>
                            <Card.Text style={{ fontSize: '18px', lineHeight: '1.6' }}>
                                Из-за того, что татарам был обещан выкуп, дань Орде стала еще больше, и это не могло не вызвать недовольство народа. Шемяка организовал заговор против князя, взял его в плен и лишил зрения. Семья князя и его приближенные нашли убежище в Муроме. Князю Василию вскоре удалось освободиться, и он поселился в Твери, приняв помощь князя Бориса Тверского. Народ моментально окрестил Василия Темным, из-за того, что он полностью ослеп. В Твери Василий Темный предложил местному князю обручить их детей. Так в возрасте шести лет Иван III уже имел невесту Марию Борисовну.
                            </Card.Text>
                            <Card.Text style={{ fontSize: '18px', lineHeight: '1.6' }}>
                                Спустя некоторое время Василий вернулся в Москву, укрепил свои позиции во власти. Вскоре Шемяка умер, и с его смертью не стало междоусобных войн и разбирательств. В 1452 году, когда Ивану исполнилось всего двенадцать лет, он обвенчался со своей невестой и стал править вместе с отцом. Он владел Переяславль-Залесским, в пятнадцатилетнем возрасте выступил с первым походом против войска татарского. К своему двадцатилетию Иван III стал во главе войска Московского княжества.
                            </Card.Text>
                            <Card.Text style={{ fontSize: '18px', lineHeight: '1.6' }}>
                                Самостоятельно править Иван начал в 1462 году, после смерти Василия II. Ему было всего 22.
                            </Card.Text>
                            <Card.Text style={{ fontSize: '18px', lineHeight: '1.6' }}>
                                Иван стал наследником самой большой части отцовского удела, состоящего из части Москвы, Владимира, Коломны, Костромы, Переяславля, Суздаля, Устюга, Нижнего Новгорода. Его братья Андрей Большой, Андрей Меньший и Борис стали владельцами Вологды, Углича, Волоколамска.
                            </Card.Text>
                            <Card.Text style={{ fontSize: '18px', lineHeight: '1.6' }}>
                                Отец завещал Ивану продолжить собирать воедино русские земли, и он всячески стремился выполнить последнюю волю умершего родителя. Для объединения разрозненных территорий он использовал самые разные средства – от дипломатии и уговоров, до применения силы. В 1463-м территория Московского княжества стала больше за счет присоединения к ней Ярославского княжества, спустя 11 лет, в 1474 году к ним добавились Ростовские земли.
                            </Card.Text>
                            <Card.Text style={{ fontSize: '18px', lineHeight: '1.6' }}>
                                Это положило начало присоединению и других территорий. Постепенно территория Руси расширялась, к ней добавились Новгородские просторы, потом настала очередь Твери, Пскова и Вятки.
                            </Card.Text>
                            <Card.Text style={{ fontSize: '18px', lineHeight: '1.6' }}>
                                Большое значение имело присоединение к Московскому княжеству Новгорода с его богатейшими землями. Над его присоединением работал еще Иван Калита, но непокорный город не сдавался. Единственное, чего удалось достичь с тех пор, так это обложить его приличным оброком. Жители Новгорода не стремились попасть в московскую кабалу, они хотели остаться независимыми и с этой целью пытались заручиться поддержкой Литовских князей. Хотя окончательное решение по этому вопросу так и не приняли, потому что тогда их православной вере пришел бы конец.
                            </Card.Text>
                            <Card.Text style={{ fontSize: '18px', lineHeight: '1.6' }}>
                                Но все же во главе Новгорода вскоре оказался князь Михаил Олелькович, и в 1470-м он вынудил новгородцев заключить договор с литовским королем по имени Казимир. Когда до Ивана III дошли эти новости, он решил договориться с Новгородом через послов. Но новгородцы так и не подчинились Ивану Великому, поэтому в 1471 году он пришел к ним с войной. Шелонская битва закончилась полным поражением новгородцев. Они ждали помощи от Литовского короля, но их ожидания оказались напрасными. После переговоров, Новгород все-таки стал вотчиной Московского княжества.
                            </Card.Text>
                            <Card.Text style={{ fontSize: '18px', lineHeight: '1.6' }}>
                                Однако новгородские бояре продолжали бунтовать, и никак не признавали в Иване государя. Тогда в 1477 году Великий опять выступил с походом к непокорному городу и на протяжении двух лет держал его в изнурительной осаде. Осада длилась до тех пор, пока город не сдался на милость победителя. В 1480-м Иван III отдал распоряжение переселить жителей Новгорода в Московское княжество, а купцы и бояре из Москвы переехали на новгородские земли.
                            </Card.Text>
                            <Card.Text style={{ fontSize: '18px', lineHeight: '1.6' }}>
                                Самым главным событием того же, 1480 года стало то, что Русь навсегда освободилась от уплаты дани Орде. После 240 лет ига это воспринималось как настоящее освобождение, достичь которого удалось практически мирным путем, не пролив кровь ни одного воина с обеих сторон. На протяжении целого лета хан Ахмат со своими войсками стояли против Ивана Великого и его войск по противоположным берегам речки Угры. Однако сражения не было, Ахмат ретировался ни с чем, у него просто сдали нервы.
                            </Card.Text>
                            <Card.Text style={{ fontSize: '18px', lineHeight: '1.6' }}>
                                Во времена царствования Великого вместо старого деревянного Кремля был построен новый, кирпичный. Кроме этого разработали и издали Судебник, вместивший в себя все государственные законы, благодаря которому держава стала единым целым, с четко ограниченными границами. Начала развиваться дипломатия и система землевладения. Постепенно формировалось крепостничество. До этого крестьянин мог в любое время перейти к другому хозяину, а по новому закону появилось ограничение – Юрьев день. Теперь чтобы перейти на другое место, нужно было дождаться определенного времени года – осени, когда праздновался день Георгия Победоносца. Совершить переход можно было за неделю до этого дня или в течение недели после празднования.
                            </Card.Text>
                            <Card.Text style={{ fontSize: '18px', lineHeight: '1.6' }}>
                                Стараниями князя Ивана Великого Московское княжество постепенно становилось крепким государством, слава о котором докатилась до Европы. Самого Ивана теперь называли «государь всея Руси». По мнению историков, современная Россия основана на том фундаменте, который в те годы создал именно Иван III. Главный символ России – двуглавый орел, тоже был придуман Иваном Великим, и с тех пор украшает государственный герб. Еще один символ Московского княжества – Георгий Победоносец, копьем поражающий змия, тоже появился во времена правления Великого. Его заимствовали у Византии.
                            </Card.Text>
                            <Card.Text style={{ fontSize: '18px', lineHeight: '1.6' }}>
                                Известное выражение «Москва – Третий Рим», дошло до нас тоже с тех времен. Это объясняется тем, что он сумел увеличить площадь державы почти в три раза.
                            </Card.Text>
                        </Card.Body>
                    </Card>
                </Col>
            </Row>
        </Container>
    )
}